app/controllers/songs_controller.rb

  def show
    if params[:artist_id]
      @artist = Artist.find(params[:artist_id])
---
SELECT "artists".* FROM "artists" WHERE (1)