app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "id"."id" = ? LIMIT ?  [["id", "1"], ["LIMIT", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "songs".* FROM "songs"  ORDER BY "songs"."id" DESC LIMIT 1
SELECT "artists".* FROM "artists"
---
  def index
    if params[:artist_id]
      if Artist.find_by(id: params[:artist_id])
        @songs=Artist.find_by(id: params[:artist_id]).songs
      elsif @song.nil?
        flash[:alert] = "Artist not found."
        redirect_to artists_path
      end
    else
      @songs=Song.all

SELECT  "artists".* FROM "artists" WHERE "artists"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT ?  [["artist_id", 2], ["id", 3], ["LIMIT", 1]]
SELECT  "songs".* FROM "songs" WHERE (3) LIMIT ?  [["LIMIT", 1]]
---
  def show
    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
      @song = @artist.songs.find_by(id: params[:id])
      if @song.nil?
        redirect_to artist_songs_path(@artist), alert: "Song not found"
      end
    else
      @song = Song.find(params[:id])